const MORSE_TABLE = {
    '.-': 'a',
    '-...': 'b',
    '-.-.': 'c',
    '-..': 'd',
    '.': 'e',
    '..-.': 'f',
    '--.': 'g',
    '....': 'h',
    '..': 'i',
    '.---': 'j',
    '-.-': 'k',
    '.-..': 'l',
    '--': 'm',
    '-.': 'n',
    '---': 'o',
    '.--.': 'p',
    '--.-': 'q',
    '.-.': 'r',
    '...': 's',
    '-': 't',
    '..-': 'u',
    '...-': 'v',
    '.--': 'w',
    '-..-': 'x',
    '-.--': 'y',
    '--..': 'z',
    '.----': '1',
    '..---': '2',
    '...--': '3',
    '....-': '4',
    '.....': '5',
    '-....': '6',
    '--...': '7',
    '---..': '8',
    '----.': '9',
    '-----': '0',
};

/*
    Задача
Ваша задача — написать функцию, которая декодирует азбуку Морзе и возвращает строку. Напишите свое решение в src/index.js.

Строка ввода. Его длина кратна 10.

Каждая буква алфавита закодирована точками (.) и тире (-). 10 означает точку (.), 11 означает тире (-).
Длина каждой закодированной буквы равна 10.
Если длина закодированной буквы меньше 10, она дополняется 0.
Пробел в строке **********. Вывод: строка (декодированная). Пример: me -> m === -- === 0000001111, e === . === 0000000010 -> 00000011110000000010
*/

function decode(expr) {
    // write your solution here
    // 10 тадан символга ажратиб кичик-кичик массивдан иборат булган ягона массив яратиш
    let arr = [];
    for (let i = 0; i < expr.length; i += 10) {
        arr.push(expr.substring(i, i + 10));
    }

    // массив элементларини ички 2 тадан символдан иборат булган, 5 та элементдан иборат булган кичик массивчаларга ажратиш
    arr = arr.map((str) => {
        if (str === '**********') {
            return [' '];
        }
        let litlleArr = [];
        for (let i = 0; i < str.length; i += 2) {
            litlleArr.push(str.substring(i, i + 2));
        }
        return litlleArr;
    });
    console.log(arr);
    
    // массивдаги "00" лардан халос булиш
    arr = arr.map(item => item.filter(num => num !== '00'));
    console.log(arr)
    
    // массив элементларини 11 булса "-" , га 10 булса "." ларга алмаштириш
    arr = arr.map(item => item.map(str => (str === '11') ? '-' : str === '10' ? '.' : ' '))
    console.log(arr);

    // Массивни кичик массивлардан битта ягона массивга келтириш
    arr = arr.map(item => item.join(''));
    console.log(arr)

    // массив элементларидан ягона матн ясаш
    arr = arr.reduce((acc, str) => {
        if (str === ' ') {
            acc += str;
            return acc;
        } else {
            acc += MORSE_TABLE[str];
            return acc;
        }
    }, '') 
    return arr;
}

console.log(decode('0000001111**********0000000010'));

module.exports = {
    decode,
};
